{

    "case_num": {
        "fchr": "Order No. 00-010",
        "doah": "Case No. 98-1924"
    },
    "judge": {
        "name":"Stuart M. Lerner"
    },
    "casetype": {
        "type": "DISCRIMINATORY HOUSING PRACTICE"
    },

    "description": "Petitioner Heather B. McNulty filed a housing discrimination complaint pursuant to the Fair Housing Act, Sections 760.20 - 760.37, Florida Statutes (1995), alleging that Respondents Summer Lake Apartments, Ms. Vicky Atkinson, Manager, and Pittco Summer Lakes Associates, Ltd. (Pittco), committed a discriminatory housing practice on the basis of Petitioner's mental handicap when they refused to rent Petitioner an apartment.",
    "name": {
        "petitioner": "Heather B. McNulty",
        "respondent": "Summer Lake Apartments; Ms. Vicky Atkinson, Manager; and Pittco Summer Lakes Associates, LTD."
      },
    "attorneys": {
        "atty_petitioner": "Heather B. McNulty, Pro Se",
        "atty_respondent": "John D. Buchanan, Jr., Esq."
      },

    "result": {
        "description": "Remand to Administrative Law Judge"

    },
    "title": {
        "description": "ORDER FINDING DISCRIMINATORY HOUSING PRACTICE AS TO RESPONDENT ATKINSON AND REMANDING PETITION FOR RELIEF FOR DETERMINATION OF UNRESOLVED ISSUES"

    },
    "opinion": {
        "heading_1": "Preliminary Matters",
        "heading_1_text": ["Petitioner Heather B. McNulty filed a housing discrimination complaint pursuant to the Fair Housing Act, Sections 760.20 - 760.37, Florida Statutes (1995), alleging that Respondents Summer Lake Apartments, Ms. Vicky Atkinson, Manager, and Pittco Summer Lakes Associates, Ltd. (Pittco), committed a discriminatory housing practice on the basis of Petitioner's mental handicap when they refused to rent Petitioner an apartment. The allegations set forth in the complaint were investigated, and, on September 18, 1997, the Executive Director issued his determination finding that there was no reasonable cause to believe that a discriminatory housing practice had occurred. Petitioner filed a Petition for Relief from a Discriminatory Housing Practice, containing allegations of both handicap and familial status discrimination, and the case was transmitted to the Division of Administrative Hearings for the conduct of a formal proceeding. An evidentiary hearing was held by videoconference in Ft. Lauderdale, Florida, and Tallahassee, Florida, on September 15, 1998, before Administrative Law Judge Stuart M. Lerner. Judge Lerner issued a Recommended Order finding that a discriminatory housing practice had occurred, dated October 1, 1998. Pursuant to notice, public deliberations were held on August 31, 1999, by means of Communications Media Technology (namely, telephone) before a panel of Commissioners. In an Order filed October 11, 1999, the Commission panel ordered that the Petition for Relief be remanded to the Administrative Law Judge for determination of whether Respondent Pittco had notice of the proceeding before the Administrative Law Judge, an issue raised by Respondent Pittco in a document filed on August 30, 1999, entitled, 'Petition for a Continuance, and Objection to Jurisdiction of the Commission on Human Relations or Remand Back to DOAH.' Judge Lerner subsequently issued a 'Recommended Order of Dismissal on Remand,' dated October 19, 1999. Pursuant to notice, public deliberations were held on July 25, 2000, by means of Communications Media Technology (namely, telephone) before this panel of Commissioners. The public access point for these telephonic deliberations was the Office of the Florida Commission on Human Relations, 325 John Knox Road, Building F, Suite 240, Tallahassee, Florida, 32303-4149. At these deliberations, the Commission panel determined the action to be taken on the Recommended Order of Dismissal on Remand. "],
        "heading_2": "Respondent Pittco's Exceptions",
        "heading_2_text": ["Respondent Pittco filed 13 numbered exceptions to the Recommended Order of Dismissal on Remand (there is no number '2' and number '4' appears twice) in a document entitled, 'Exceptions to the Recommended Order of Dismissal on Remand by the Respondent, Pittco Summer Lakes Associates, Ltd.' Through this filing Respondent Pittco requests either reversal of the Recommended Order finding that it committed a discriminatory housing practice or remand of the case for a new hearing. See, Pleading, first paragraph. "],
        "heading_3": "Exceptions 3, 4, 6, 7, 8, 9, 10",
        "heading_3_text":["We conclude that Exceptions number 3, number 4, number 6, number 7, number 8, number 9, and number 10, relate to findings made by the Administrative Law Judge as a result of the hearing on the merits. See, Pleading. The Commission's file does not contain a transcript of the proceeding on the merits before the Administrative Law Judge. The filing of such a transcript is a requirement to the filing of exceptions to a Recommended Order. See, Fla. Admin. Code R. 60Y-4.025(3), and Fla. Admin. Code R. 60Y-4.027(1). In the absence of the filing of such a transcript the Commission has ordered exceptions stricken. See, Ebeh v. Consumer Credit Counseling Service of the Tampa Bay Area, Inc., 16 F.A.L.R. 2149, at 2150 (FCHR 1994), and Lee v. Emmer Development Corporation, 20 F.A.L.R. 3132, at 3134 (FCHR 1998). Exceptions number 3, number 4, number 6, number 7, number 8, number 9, and number 10, are hereby stricken. "],
        "heading_4": "Exception 1",
        "heading_4_text":["Exception number 1 takes exception to the finding that Pittco had notice of the proceedings before the Administrative Law Judge. See, Pleading. Our review of the Recommended Order of Dismissal on Remand does not reveal a specific finding by the Administrative Law Judge that Respondent Pittco had notice of the proceeding before the Administrative Law Judge. See, Recommended Order of Dismissal on Remand. Rather the Administrative Law Judge simply concluded that it was unnecessary to determine this issue, given the Administrative Law Judge's conclusion that Petitioner had not proved entitlement to relief. See, Recommended Order of Dismissal on Remand, pages 11 and 12. We note the Administrative Law Judge's findings in the initial Recommended Order, restated in the Recommended Order of Dismissal on Remand, that 'Pittco no longer owns Summer Lakes and Ms. Atkinson no longer is its manager,' and 'Pittco sold Summer Lakes to SummerLake Oakland Park, Ltd., on or some time before July 1, 1998.' See, Recommended Order, dated October 1, 1998, 27 and 28, and Recommended Order of Dismissal on Remand. We note that the Commission's record reflects that the Notice of Hearing by Video Teleconference for the September 15, 1998, hearing on the merits, dated July 22, 1998, was sent, with regard to Respondents in this case, to the 'Manager, Summer Lake Apartments' and 'Ms. Vicky Atkinson-Keating.' See, Filing. Vicky Atkinson-Keating is herself a named Respondent in the case. See, caption of Recommended Order of Dismissal on Remand, and Complaint. The Administrative Law Judge found that Respondent Pittco sold the apartment complex in question on or before July 1, 1998, consequently, in our view it could not be concluded that service on the 'Manager, Summer Lake Apartments,' amounted to service on Pittco. The remaining issue is whether service on Vicky Atkinson-Keating amounted to service on Pittco. Given the finding that Pittco no longer owned the complex at the time of service of the Notice of Hearing by Video Teleconference and the finding that Ms. Atkinson-Keating no longer was the manager of the complex, along with the absence of a finding by the Administrative Law Judge that Ms. Atkinson-Keating was an agent of Respondent Pittco at the time the Notice of Hearing by Video Teleconference was served on July 22, 1998, we conclude that Respondent Pittco did not have notice of the proceeding before the Administrative Law Judge. Exception number 1 is hereby accepted to the extent it supports the contention that Respondent Pittco did not have notice of the proceeding on the merits before the Administrative Law Judge. We note that this is an issue that is raised by both Respondent's exception number 1 and the record. In our view it is an issue preliminary to the actual merits of the case and, consequently, conclude it not necessary for the Commission to require a transcript of the proceeding on the merits to consider this exception. Alternatively, we note that this issue was raised by the record, itself, and consequently the Commission has the authority to consider the matter sua sponte."],
        "heading_5": "Exceptions 5, 11, 12, 13",
        "heading_5_text":["Respondent's exceptions number 5, number 11, number 12, and number 13, take exception to the Administrative Law Judge's conclusion that, even though it was found that Respondents committed a discriminatory housing practice, the recommendation that Petitioner did not show entitlement to relief and that the Petition should therefore be dismissed, is an outcome fully favorable to Respondent Pittco and, therefore, further proceedings are not required. See, Recommended Order of Dismissal on Remand, page 11. The Fair Housing Act provides for progressively severe penalties in court actions for those who have in the past been found to have committed discriminatory housing practices and who have again been found to have committed discriminatory housing practices. See, Section 760.34(7)(b), Florida Statutes (1999), regarding the schedule of fines for violating the Fair Housing Act. In addition, the Fair Housing Act directs that when a discriminatory housing practice is found to have occurred, the Administrative Law Judge shall issue a recommended order prohibiting the practice and recommending affirmative relief. See, Section 760.35(3)(b), Florida Statutes (1999); see, also, Fletcher v. Hatfield, 18 F.A.L.R. 1590 (FCHR 1995), where the Commission issued a final order finding that a discriminatory housing practice occurred and ordered the Respondent to cease and desist from committing the discriminatory housing practice further, even though no entitlement to other relief was demonstrated other than for some costs. Given these two statutory provisions, we conclude that the Administrative Law Judge committed an error of law in concluding that the recommended dismissal of the Petition for Relief was a result fully favorable to Respondent Pittco even though a discriminatory housing practice was found to have occurred. In concluding that this error of law occurred, we find that the conclusion of law being modified is one over which the Commission has substantive jurisdiction, namely the interpretation of the remedy provisions of the Fair Housing Act, and that the correction being made by the Commission is as or more reasonable than the conclusion being corrected, and that the Commission's reason for the correction is an incorrect interpretation of the Fair Housing Act and prior Commission case law by the Administrative Law Judge. See, Section 120.57(1)(l), Florida Statutes (1999). With regard to the filing of a transcript, please note that these exceptions are to conclusions set out in the Recommended Order of Dismissal on Remand for which no proceeding took place from which a transcript could be made. "],
        "heading_6": "Exception 2",
        "heading_6_text":["Finally, we note that the above discussion deals with all Respondent's exceptions numbered 1 through 13, but that there actually is no exception number 2 contained in the filing. "],
        "heading_7": "Petitioner's Exceptions",
        "heading_7_text":["Petitioner filed a four-page document, entitled 'Exceptions,' which essentially excepts to the lack of a monetary award in the Recommended Order of Dismissal on Remand. See, Filing. In our view, the issue of entitlement to remedy is an issue that is raised in the initial Recommended Order, dated October 1, 1998, as a result of the proceeding on the merits before the Administrative Law Judge. As indicated, above, the Commission's file does not contain a transcript of the proceeding before the Administrative Law Judge. The Commission's rules require a party filing exceptions to provide the Commission with a transcript of the proceedings before the Administrative Law Judge (see, Fla. Admin. Code R. 60Y-4.025(3) and 60Y-4.027(1)). In the absence of the filing of a transcript the Commission has ordered exceptions stricken. See, Ebeh v. Consumer Credit Counseling Service of Tampa Bay Area, Inc., 16 F.A.L.R. 2149, at 2150 (FCHR 1994), and Lee v. Emmer Development Corporation, 20 F.A.L.R. 3132, at 3134 (FCHR 1998). Petitioner's exceptions are hereby stricken. "],
        "heading_8": "Findings of Fact",
        "heading_8_text":["The Administrative Law Judge's findings of fact are supported by competent substantial evidence with regard to the liability of Respondent Vicky Atkinson-Keating. We adopt the Administrative Law Judge's findings of fact with regard to the liability of Respondent Vicky Atkinson-Keating. The proceeding within which findings of fact were made with regard to Respondent Pittco did not comply with the essential requirements of law as to Respondent Pittco, since, as we have concluded, above, Respondent Pittco did not have notice of the proceeding on the merits conducted by the Administrative Law Judge. Accordingly, we do not accept the findings of fact with regard to Respondent Pittco. "],
        "heading_9": "Conclusions of Law",
        "heading_9_text":["The Administrative Law Judge's conclusions of law are a correct application of the law to the facts with regard to the determination that Respondent Vicky Atkinson-Keating committed a discriminatory housing practice in this matter. We note that the Administrative Law Judge concluded that Petitioner was not entitled to a monetary award in this matter. Recommended Order, 38. In so doing, the Administrative Law Judge noted that the Fair Housing Act, 'authorizes the Commission to award compensatory damages to the victim of a 'discriminatory housing practice,' but only if the damages are quantifiable and their amount has been established by competent substantial evidence.' Id. The Administrative Law Judge concluded that Petitioner did not demonstrate that she suffered any quantifiable damages as a result of the discriminatory housing practice found to have occurred, and that, 'While Petitioner did claim at hearing that Ms. Atkinson's and Pittco's 'discriminatory housing practice' made her sick and lose weight, the Commission is without authority to award monetary damages for such noneconomic, nonquantifiable injuries.' Id. In a 1999 decision, a Commission panel stated, 'The Administrative Law Judge also declined to award damages for emotional damages. We find this to be in error since damages for emotional distress are recoverable under the Fair Housing Act [citations omitted]. Although it may be difficult to quantify these damages, it can and must be done where evidence supports a finding of emotional distress. We thus conclude that the Administrative Law Judge erred in not awarding damages for emotional distress provided there was sufficient proof to establish that [complainants] suffered such damages.' Florida Commission on Human Relations, et al. v. Ballynahinch Condominium Association, et al., FCHR Order No. 99-005 (FCHR 1999). We conclude that the Administrative Law Judge committed an error of law in simply concluding that the Commission is without authority to award monetary damages for such 'noneconomic, nonquantifiable injuries' as making complainant sick and lose weight (Recommended Order, 38), and conclude this issue should be remanded to the Administrative Law Judge for a determination of whether the evidence presented indicated any quantifiable amounts of damage, for damages which the Administrative Law Judge simply characterized as 'nonquantifiable,' given the Commission's pronouncement in Ballynahinch, supra. In concluding that this error of law occurred, we find that the conclusion of law being modified is one over which the Commission has substantive jurisdiction, namely the interpretation of the remedy provisions of the Fair Housing Act, and that the correction being made by the Commission is as or more reasonable than the conclusion being corrected, and that the Commission's reason for the correction is an interpretation of the Fair Housing Act by the Administrative Law Judge that is inconsistent with prior Commission case law. See, Section 120.57(1)(l), Florida Statutes (1999). The proceeding within which conclusions of law were made with regard to Respondent Pittco did not comply with essential requirements of law as to Respondent Pittco, since, as we have concluded, above, Respondent Pittco did not have notice of the proceeding on the merits conducted by the Administrative Law Judge. Accordingly, for this reason and for reasons set out in the 'Respondent Pittco's Exceptions' section of this Order, we do not accept the conclusions of law with regard to Respondent Pittco. "],
        "heading_10": "Remand",
        "heading_10_text":["This matter is hereby REMANDED to the Administrative Law Judge for further proceedings consistent with this Order, namely further consideration of the remedy Petitioner is entitled to as to Respondent Vicky Atkinson-Keating, and a new proceeding on the merits including issues of both liability and remedy with regard to Respondent Pittco."],
        "heading_11": "",
        "heading_11_text":[""]
    }
}
