{

    "case_num": {
        "fchr": "Order No. 00-013",
        "doah": "Case No. 96-1907"
    },
    "judge": {
        "name":"Ella Jane P. Davis"
    },
    "casetype": {
        "type": "UNLAWFUL EMPLOYMENT PRACTICE"
    },

    "description": "Petitioner Marvin Young filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1995), alleging that Respondent Bruno's, Inc., committed an unlawful employment practice on the basis of Petitioner's handicap (epilepsy) when it terminated him from his position.",
    "name": {
        "petitioner": "Marvin Young",
        "respondent": "Bruno's, Inc."
      },
    "attorneys": {
        "atty_petitioner": "Marvin Young, Pro Se",
        "atty_respondent": "Deborah A. Mattison, Esq."
      },

    "result": {
        "description": "Dismissed With Prejudice"

    },
    "title": {
        "description": "FINAL ORDER DISMISSING PETITION FOR RELIEF FROM AN UNLAWFUL EMPLOYMENT PRACTICE "

    },
    "opinion": {
        "heading_1": "Preliminary Matters",
        "heading_1_text": ["Petitioner Marvin Young filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1995), alleging that Respondent Bruno's, Inc., committed an unlawful employment practice on the basis of Petitioner's handicap (epilepsy) when it terminated him from his position. The allegations set forth in the complaint were investigated, and, on March 14, 1996, the Executive Director issued his determination finding that there was reasonable cause to believe that an unlawful employment practice had occurred. Petitioner filed a Petition for Relief from an Unlawful Employment Practice, and the case was transmitted to the Division of Administrative Hearings for the conduct of a formal proceeding. An evidentiary hearing was held in Tallahassee, Florida, on January 7 and 8, 1997, before Administrative Law Judge Ella Jane P. Davis. Judge Davis issued a Recommended Order of dismissal, date June 6, 1997. Following a period of abatement due to bankruptcy proceedings and pursuant to notice, public deliberations were held on August 1, 2000, by means of Communications Media Technology (namely, telephone) before this panel of Commissioners. The public access point for these telephonic deliberations was the Office of the Florida Commission on Human Relations, 325 John Knox Road, Building F, Suite 240, Tallahassee, Florida, 32303-4149. At these deliberations, the Commission panel determined the action to be taken on the Petition for Relief. "],
        "heading_2": "Findings of Fact",
        "heading_2_text": ["We find the Administrative Law Judge's findings of fact to be supported by competent substantial evidence."],
        "heading_3": "Conclusions of Law",
        "heading_3_text":["We find the Administrative Law Judge's application of the law to the facts to result in a correct disposition of the matter. We adopt the Administrative Law Judge's conclusions of law. "],
        "heading_4": "Exceptions",
        "heading_4_text":["Neither party filed exceptions to the Administrative Law Judge's Recommended Order."],
        "heading_5": "Dismissal",
        "heading_5_text":["The Petition for Relief and Complaint of Discrimination are DISMISSED with prejudice. The parties have the right to seek judicial review of this Order. The Commission and the appropriate District Court of Appeal must receive notice of appeal within 30 days of the date this Order is filed with the Clerk of the Commission. Explanation of the right to appeal is found in Section 120.68, Florida Statutes, and in the Florida Rules of Appellate Procedure 9.110. "],
        "heading_6": "",
        "heading_6_text":[""],
        "heading_7": "",
        "heading_7_text":[""],
        "heading_8": "",
        "heading_8_text":[""],
        "heading_9": "",
        "heading_9_text":[""],
        "heading_10": "",
        "heading_10_text":[""],
        "heading_11": "",
        "heading_11_text":[""],
        "heading_12": "",
        "heading_12_text":[""]
    }
}
