{

    "case_num": {
        "fchr": "Order No. 00-027",
        "doah": "Case No. 00-0410"
    },
    "judge": {
        "name":"Diane Cleavinger"
    },
    "casetype": {
        "type": "UNLAWFUL EMPLOYMENT PRACTICE"
    },

    "description": "Petitioner Rosalind Besson filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1997), alleging that Respondent School Board of Wakulla County committed an unlawful employment practice on the basis of Petitioner's disability (unspecified, but alleged to be known by Respondent) and on the basis of retaliation when it failed to hire Petitioner for a position for which she had applied.",
    "name": {
        "petitioner": "Rosalind Besson",
        "respondent": "School Board of Wakulla County"
      },
    "attorneys": {
        "atty_petitioner": "Gary L. Printy, Esq.",
        "atty_respondent": "C. Graham Carothers, Esq."
      },

    "result": {
        "description": "Remanded to Administrative Law Judge"

    },
    "title": {
        "description": "ORDER REMANDING REQUEST FOR RELIEF FROM AN UNLAWFUL EMPLOYMENT PRACTICE"

    },
    "opinion": {
        "heading_1": "Preliminary Matters",
        "heading_1_text": ["Petitioner Rosalind Besson filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1997), alleging that Respondent School Board of Wakulla County committed an unlawful employment practice on the basis of Petitioner's disability (unspecified, but alleged to be known by Respondent) and on the basis of retaliation when it failed to hire Petitioner for a position for which she had applied. Petitioner requested an administrative hearing and the Commission transmitted the case to the Division of Administrative Hearings for the conduct of a formal proceeding. Prior to the conduct of a formal proceeding, Administrative Law Judge Diane Cleavinger issued a Recommended Order of Dismissal, dated June 14, 2000. Pursuant to notice, public deliberations were held on December 7, 2000, by means of Communications Media Technology (namely, telephone) before this panel of Commissioners. The public access point for these telephonic deliberations was the Office of the Florida Commission on Human Relations, 325 John Knox Road, Building F, Suite 240, Tallahassee, Florida, 32303-4149. At these deliberations, the Commission panel determined the action to be taken on the Recommended Order of Dismissal."],
        "heading_6": "Conclusions of Law",
        "heading_6_text":["The Administrative Law Judge concluded that since Petitioner had not filed a 'petition for relief,' Petitioner's action was untimely because 'Petitioner is required to file a petition in order to complete Petitioner's request for a hearing and afford Respondent due process.' Recommended Order of Dismissal, page 3. The Administrative Law Judge also concluded that, since no determination had been issued, Petitioner had to request an administrative hearing within 35 days of the expiration of 180 days following the filing of the charge of discrimination. Recommended Order of Dismissal, page 3. The Administrative Law Judge further concluded that, '[a] request for administrative hearing...must be requested no later than 35 days after the determination of reasonable cause by the Commission or the date Petitioner makes an election of rights when no determination has been made by FCHR within 180 days.' Recommended Order of Dismissal, page 2. We conclude that these represent errors of law which require the matter to be remanded to the Administrative Law Judge for further proceedings on the request for administrative hearing. The Florida Civil Rights Act of 1992 (Act) states, 'In the event that the commission fails to conciliate or determine whether there is reasonable cause on any complaint under this section within 180 days of the filing of the complaint, an aggrieved person may proceed under subsection (4), as if the commission determined that there was reasonable cause.' Section 760.11(8), Florida Statutes (1999). The referred to subsection (4) states, 'In the event that the commission determines that there is reasonable cause to believe that a discriminatory practice has occurred in violation of the Florida Civil Rights Act of 1992, the aggrieved person may either: (a) Bring a civil action against the person named in the complaint in any court of competent jurisdiction; or (b) Request an administrative hearing under ss. 120.569 and 120.57.' Section 760.11(4), Florida Statutes (1999). With regard to civil suits, the Act states, 'A civil action brought under this section shall be commenced no later than 1 year after the date of determination of reasonable cause by the commission.' Section 760.11(5), Florida Statutes (1999). With regard to administrative proceedings, the Act states, 'An administrative hearing pursuant to (4)(b) must be requested no later than 35 days after the date of determination of reasonable cause by the commission.' Section 760.11(6), Florida Statutes (1999). In interpreting these statute sections a Commission panel stated, '...we conclude that the plain meaning of the cited statutory provisions is that a complainant may request an administrative hearing at any time after the conclusion of the initial 180-day period following the filing of the complaint and no later than 35 days after the date of a determination by the Commission (or simply no later than 35 days after the date of determination, if the Commission's investigation is completed within 180 days of the filing of the complaint).' Wilson v. Scotty's, Inc., FCHR Order No. 98-032 (FCHR 1998). With regard to the conclusion that the request for administrative hearing must be filed within 35 days of the filing of the election of rights form, a Commission panel considering a similar conclusion, stated, '...there is no such statutory requirement.' Adams v. Orange County School Board, FCHR Order No. 99-010, May 17, 1999. With regard to the conclusion that a petition for relief must be filed to complete the request for administrative hearing, a Commission panel has stated, 'We note that: (1) The statutory sections in question, relating to a 35-day time period, do not refer to the filing of a Petition for Relief, but rather refer to the request for an administrative hearing; and (2) The event which triggers the 35-day time period for filing is the issuance of a 'determination' by the Commission. Section 760.11(6), Florida Statutes (1997). In this case, Petitioner filed a form provided him by the Commission, and checked the box that indicated, 'More than 180 days have elapsed since I filed my charge of discrimination. I wish to withdraw my charge and file a Petition for Relief to proceed with an administrative hearing as provided for under Florida Statutes Section 760.11(4)(b) and (8). [citation omitted.]' We conclude that this amounts to the statutorily referred to request for an administrative heaing and that the request was filed within the time frame set out in Wilson, supra, since no determination has been issued by the Commission in this matter.' Adams, supra. Based on the foregoing, and since no determination has been issued in the instant case, we conclude that the Administrative Law Judge committed an error of law in concluding that the request for administrative hearing was untimely. Finally, we find: (1) that the conclusions of law we are modifying are ones over which the Commission has substantive jurisdiction, namely the interpretation of the time period for filing a request for administrative relief under the Florida Civil Rights Act of 1992 and the determination of the requirements of a request for administrative hearing under the Florida Civil Rights Act of 1992; (2) that the corrections being made by the Commission are as or more reasonable than the conclusions being corrected; and (3) the reason for the corrections is an interpretation of the Florida Civil Rights Act of 1992 by the Administrative Law Judge that runs contrary to previous Commission action. See Section 120.57(1)(l), Florida Statutes (1999)."],
        "heading_7": "Exceptions",
        "heading_7_text":[" Petitioner filed a document entitled, 'Petitioner's Exceptions to Recommended Order,' containing 10 numbered paragraphs. Each paragraph, itself, is not an exception, but rather the document excepts to the Administrative Law Judge's conclusion that Petitioner was required to file a 'petition,' noting that Petitioner filed a charge of discrimination setting forth the facts in dispute and an Election of Rights form indicating a request for hearing, and arguing that this 'substantially complied' with the petition-filing requirements. See, Pleading, 9 and 10. For reasons discussed in the Conclusions of Law section of this Order, we accept Petitioner's exceptions."],
        "heading_8": "Remand",
        "heading_8_text":["The Request for Administrative Hearing and Complaint of Discrimination are hereby REMANDED to the Administrative Law Judge for further proceedings consistent with this Order."]
    }
}
