{

  "case_num": {
      "fchr": "Order No. 00-025",
      "doah": "Case No. 99-4041"
  },
  "judge": {
      "name":"Donald R. Alexander"
  },
  "casetype": {
      "type": "UNLAWFUL EMPLOYMENT PRACTICE"
  },

  "description": "Petitioner Ausbon Brown, Jr., filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes(1997), alleging that Respondent Agency for Health Care Administration committed an unlawful employment practice on the basis of Petitioner's age (born on April 25, 1943), sex (male) and race (Black) when it failed to hire him for several positions for which he had applied.",
  "name": {
      "petitioner": "Ausbon Brown",
      "respondent": "Agency For Health Care Administration"
    },
  "attorneys": {
      "atty_petitioner": "Ausbon Brown, Pro Se",
      "atty_respondent": "Stephen W. Foxwell, Esq."
    },

  "result": {
      "description": "Unlawful Employment Practice Found, Case Remanded to Administrative Law Judge for Determination of Relief"

  },
  "title": {
      "description": "ORDER FINDING UNLAWFUL EMPLOYMENT PRACTICES OCCURRED AND REMANDING MATTER FOR DETERMINATION OF RELIEF"

  },
    "opinion": {
        "heading_1": "Preliminary Matters",
        "heading_1_text": ["Petitioner Ausbon Brown, Jr., filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1997), alleging that Respondent Department of Health committed an unlawful employment practice on the basis of Petitioner's age (born on April 25, 1943), sex (male) and race (Black) when it failed to hire him for several positions for which he had applied. The allegations set forth in the complaint were investigated, and, on August 18, 1999, the Executive Director issued his determination finding that there was no reasonable cause to believe that an unlawful employment practice had occurred. Petitioner filed a Petition for Relief from an Unlawful Employment Practice, and the case was transmitted to the Division of Administrative Hearings for the conduct of a formal proceeding. An evidentiary hearing was held by video teleconferencing in Tallahassee, Florida, and Daytona Beach, Florida, on February 14, 2000, before Administrative Law Judge Donald R. Alexander. Judge Alexander issued a Recommended Order of dismissal, dated March 14, 2000. Pursuant to notice, public deliberations were held on October 26, 2000, by means of Communications Media Technology (namely, telephone) before this panel of Commissioners. The public access point for these telephonic deliberations was the Office of the Florida Commission on Human Relations, 325 John Knox Road, Building F, Suite 240, Tallahassee, Florida, 32303-4149. At these deliberations, the Commission panel determined the action to be taken on the Petition for Relief. "],
        "heading_2": "Finding of Fact and Conclusion of Law",
        "heading_2_text": ["The Administrative Law Judge found that four positions were at issue for which Petitioner alleged that he had applied (positions 29618, 67370, 80690, and 66224), but for which Petitioner was not hired. Recommended Order, 5. In each instance, Petitioner alleged that his failure to be hired was on the basis of his race, sex and age. Recommended Order, 1. The Administrative Law Judge found that Petitioner did not apply for position 29618, and that, therefore, the allegations for that claim need not be considered. Recommended Order, 20. While the Administrative Law Judge found that no prima facie case of discrimination had been established with regard to some of the alleged bases, the Administrative Law Judge did find, with regard to each of the three positions remaining in question, that a prima facie case of discrimination had been established at least as to one or more of the alleged bases. Recommended Order, 21. The Administrative Law Judge also concluded that Respondent rebuttd the established prima facie cases of discrimination in that, in each instance, a person who was better qualified than Petitioner was selected, and that there was no credible evidence that Respondent's actions were a pretext for discrimination. Recommended Order, 22. We conclude (by a 2 to 1 vote, Commissioners Farrell and Paige in the majority, Commissioner Sosa in the minority) that the Administrative Law Judge committed an error of law in concluding that there was no evidence that Respondent's actions were a pretext for discrimination, and conclude that a correct application of the law to the facts results in the necessary conclusion that as a matter of law, the fact exists that Respondent unlawfully discriminated against Petitioner in failing to hire Petitioner for the three positions at issue. In conclusions of law adopted by a Commission panel, it has been stated, 'The Petitioner may make [a] showing of pretext either directly by persuading the trier of fact that a discriminatory reason more likely motivated the employer or indirectly by showing that the employer's proffered explanation is unworthy of credence. [citation omitted.] The employee may demonstrate that the employer's reasons are unworthy of credence by showing (1) that the proffered reasons had no basis in fact, (2) that the proffered reasons did not actually motivate [the adverse employment action], or (3) that they were insufficient to motivate [the adverse employment action].' Grandison v. Consolidated Freightways Corporation of Delaware, 15 F.A.L.R. 2268, at 2277 (FCHR 1993). Other factors that can be relevant to a showing of pretext include, '(1) the employer's prior treatment of the plaintiff, (2) the employer's general policy and practice with respect to minority employment, particularly statistics reflecting a general pattern and practice of discrimination, (3) disturbing procedural irregularities, and (4) the use of subjective criteria, especially when used to evaluate candidates that are not objectively equally qualified.'Colon-Sanchez v. Marsh, 34 EPD 34,314, 733 F.2d 78 (10th Cir. 1984). The Recommended Order, itself, suggests 'disturbing procedural irregularities' with regard to the hiring process for position 67370, where the Administrative Law Judge finds, 'Contrary to a suggestion by Petitioner, the competitively advertised position was not filled through the promotion of an existing employee, which would be contrary to personnel rules, but rather it was filled through the reassignment of another employee.' Recommended Order, 10. In our view this statement admits the existence of activity 'contrary to personnel rules,' and as a matter of law amounts to the required showing of pretext. Further, we conclude that this 'treatment of the plaintiff' is sufficient to establish pretext as a matter of law with regard to the other two positions remaining in question, positions 80690 and 66224. Having concluded that as a matter of law, the Respondent's articulated legitimate nondiscriminatory reason for not hiring Petitioner is in each instance for the three positions in question (positions 67370, 80690 and 66224) a pretext for unlawful discrimination, we reach the necessary ultimate conclusion that for each of the three positions in question the Respondent unlawfully discriminated against Petitioner in failing to hire him. Finally, we find: (1) that the Administrative Law Judge's conclusion of law we are correcting is within the substantive jurisdiction of the Florida Commission on Human Relations, namely the interpretation of the legal requirements for the establishment of pretext for discrimination under the Florida Civil Rights Act of 1992; (2) the reason the correction is being made is that the conclusion of law as stated by the Administrative Law Judge runs contrary to cited authority on the issue; and (3) that in making this correction the conclusion of law we are substituting is as or more reasonable than the conclusion which has been rejected. See, Section 120.57(1)(l), Florida Statutes (1999)."],
        "heading_3": "Exceptions",
        "heading_3_text":["Petitioner filed eight pages of exceptions to the Recommended Order in a document entitled, 'Petitioner's exceptions to Proposed Recommended Order filed March 14, 2000, for case # 99-4041, FCHR # 98-3107.' The Commission's file does not contain a transcript of the proceeding on the merits before the Administrative Law Judge. The filing of such a transcript is a requirement to the filing of exceptions to a Recommended Order. See, Fla. Admin. Code R. 60Y-4.025(3), and Fla. Admin. Code R. 60Y-4.027(1). In the absence of the filing of such a transcript the Commission has typically ordered exceptions stricken. See, Ebeh v. Consumer Credit Counseling Service of the Tampa Bay Area, Inc., 16 F.A.L.R. 2149, at 2150 (FCHR 1994), and Lee v. Emmer Development Corporation, 20 F.A.L.R. 3132, at 3134 (FCHR 1998). Nevertheless, we are in concurrence with the exceptions filed by Petitioner (by a 2 to 1 vote, Commissioners Farrell and Paige in the majority, Commissioner Sosa in the minority) to the extent they generally except to the finding that no unlawful employment practice occurred in this case, and to that extent Petitioner's exceptions are accepted, noting that our action on the exceptions has no impact on the outcome of the matter, given our conclusions set out in the 'Findings of Fact and Conclusions of Law' section of this Order. See Wideman v. Champion International Corp., 15 F.A.L.R. 1655 (FCHR 1992), for an example of a case in which a Commission panel considered filed exceptions (albeit denying them) in the absence of a transcript."],
        "heading_4": "Remand",
        "heading_4_text":["The Petition for Relief and Complaint of Discrimination are REMANDED to the Administrative Law Judge for determination of the appropriate remedy for the Respondent's unlawful failure to hire Petitioner for positions 67370, 80690 and 66224."],
        "heading_5": "",
        "heading_5_text":[""],
        "heading_6": "",
        "heading_6_text":[""],
        "heading_7": "",
        "heading_7_text":[""],
        "heading_8": "",
        "heading_8_text":[""],
        "heading_9": "",
        "heading_9_text":[""],
        "heading_10": "",
        "heading_10_text":[""],
        "heading_11": "",
        "heading_11_text":[""],
        "heading_12": "",
        "heading_12_text":[""]
    }
}
