{

    "case_num": {
        "fchr": "Order No. 00-001",
        "doah": "Case No. 98-3684"
    },
    "judge": {
        "name":"P. Michael Ruff"
    },
    "casetype": {
        "type": "Unlawful Employment Practice"
    },

    "description": "Petitioner James O. Johnson, III, filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1993), alleging that Respondent Pensacola Civic Center, committed an unlawful employment practice on the basis of Petitioner's race (Black) by terminating Petitioner from his position.",
    "name": {
        "petitioner": "James O. Johnson, III",
        "respondent": "Pensacola Civic Center"
      },
    "attorneys": {
        "atty_petitioner": "James O. Johnson, III, Pro Se",
        "atty_respondent": "Paul F. Flounlacker, Jr., Esq."
      },

    "result": {
        "description": "Dismissed with Prejudice"

    },
    "title": {
        "description": "FINAL ORDER DISMISSING PETITION FOR RELIEF FROM A DISCRIMINATORY HOUSING PRACTICE"

    },
    "opinion": {
        "heading_1": "Preliminary Matters",
        "heading_1_text": ["Petitioner James O. Johnson, III, filed a complaint ",
          "of discrimination pursuant to the Florida Civil Rights Act of 1992, ",
          "Sections 760.01 - 760.11, Florida Statutes (1993), alleging that ",
          "Respondent Pensacola Civic Center, committed an unlawful employment ",
          "practice on the basis of Petitioner's race (Black) by terminating ",
          "Petitioner from his position. The allegations set forth in the complaint ",
          "were investigated, and, on June 1, 1998, the Executive Director issued ",
          "his determination finding that there was no reasonable cause to believe ",
          "that an unlawful employment practice had occurred. Petitioner filed a ",
          "Petition for Relief from an Unlawful Employment Practice, and the case ",
          "was transmitted to the Division of Administrative Hearings for the conduct ",
          "of a formal proceeding. An evidentiary hearing was held in Pensacola, ",
          "Florida, on January 14, 1999, before Administrative Law Judge P. Michael Ruff. ",
          "Judge Ruff issued a Recommended Order of dismissal, dated May 27, 1999. ",
          "Pursuant to notice, public deliberations were held on January 27, 2000, ",
          "by means of Communications Media Technology (namely, telephone) before ",
          "this panel of Commissioners. The public access point for these ",
          "telephonic deliberations was the Office of the Florida Commission on ",
          "Human Relations, 325 John Knox Road, Building F, Suite 240, Tallahassee, ",
          "Florida, 32303-4149. At these deliberations, the Commission panel ",
          "determined the action to be taken on the Petition for Relief."],
        "heading_2": "Finding of Fact",
        "heading_2_text": ["A transcript of the proceeding before the Administrative ",
          "Law Judge was not filed with the Commission. We adopt the Administrative ",
          "Law Judge's findings of fact."],
        "heading_3": "Conclusions of Law",
        "heading_3_text":["We find the Administrative Law Judge's application of ",
          "the law to the facts to result in a correct disposition of the matter. ",
          "We adopt the Administrative Law Judge's conclusions of law."],
        "heading_4": "Exceptions",
        "heading_4_text":["Petitioner filed written exceptions to the ",
          "Administrative Law Judge's Recommended Order. As indicated, supra, a ",
          "transcript of the proceeding before the Administrative Law Judge was ",
          "not filed with the Commission. The filing of such a transcript is a ",
          "requirement to the filing of exceptions to the Recommended Order. ",
          "See, Fla. Admin. Code R. 60Y-4.025(3), and Fla. Admin. Code R. ",
          "60Y-4.027(1). In the absence of the filing of a transcript of the ",
          "proceeding before the Administrative Law Judge, the Petitioner's ",
          "exceptions are hereby stricken. See, Ebeh v. Consumer Credit Counseling ",
          "Service of the Tampa Bay Area, Inc., 16 F.A.L.R. 2149, at 2150 (FCHR 1994), ",
          "and Lee v. Emmer Development Corporation, 20 F.A.L.R. 3132, at 3134 (FCHR 1998)."],
        "heading_5": "Dismissal",
        "heading_5_text":["The Petition for Relief and Complaint of ",
          "Discrimination are DISMISSED with prejudice. The parties have the ",
          "right to seek judicial review of this Order. The Commission and the ",
          "appropriate District Court of Appeal must receive notice of appeal ",
          "within 30 days of the date this Order is filed with the Clerk of the ",
          "Commission. Explanation of the right to appeal is found in Section 120.68, ",
          "Florida Statutes, and in the Florida Rules of Appellate Procedure 9.110. ",
          "Done and Ordered this 11th day of February, 2000. For The Florida ",
          "Commission on Human Relations."
      ]
    }
}
