{

    "case_num": {
        "fchr": "Order No. 00-024",
        "doah": "Case No. 99-4039"
    },
    "judge": {
        "name":"Donald R. Alexander"
    },
    "casetype": {
        "type": "UNLAWFUL EMPLOYMENT PRACTICE"
    },

    "description": "Petitioner Ausbon Brown, Jr., filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes(1997), alleging that Respondent Agency for Health Care Administration committed an unlawful employment practice on the basis of Petitioner's age (born on April 25, 1943), sex (male) and race (Black) when it failed to hire him for several positions for which he had applied.",
    "name": {
        "petitioner": "Ausbon Brown",
        "respondent": "Agency For Health Care Administration"
      },
    "attorneys": {
        "atty_petitioner": "Ausbon Brown, Pro Se",
        "atty_respondent": "Michelle Oxman, Esq."
      },

    "result": {
        "description": "Unlawful Employment Practice Found, Case Remanded to Administrative Law Judge for Determination of Relief"

    },
    "title": {
        "description": "ORDER FINDING UNLAWFUL EMPLOYMENT PRACTICES OCCURRED AND REMANDING MATTER FOR DETERMINATION OF RELIEF"

    },
    "opinion": {
        "heading_1": "Preliminary Matters",
        "heading_1_text": ["Petitioner Ausbon Brown, Jr., filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes(1997), alleging that Respondent Agency for Health Care Administration committed an unlawful employment practice on the basis of Petitioner's age (born on April 25, 1943), sex (male) and race (Black) when it failed to hire him for several positions for which he had applied. The allegations set forth in the complaint were investigated, and, on August 18, 1999, the Executive Director issued his determination finding that there was no reasonable cause to believe that an unlawful employment practice had occurred. Petitioner filed a Petition for Relief from an Unlawful Employment Practice, and the case was transmitted to the Division of Administrative Hearings for the conduct of a formal proceeding. An evidentiary hearing was held in Daytona Beach, Florida, on February 10, 2000, before Administrative Law Judge Donald R. Alexander. Judge Alexander issued a Recommended Order of dismissal, dated April 7, 2000. Pursuant to notice, public deliberations were held on October 26, 2000, by means of Communications Media Technology (namely, telephone) before this panel of Commissioners. The public access point for these telephonic deliberations was the Office of the Florida Commission on Human Relations, 325 John Knox Road, Building F, Suite 240, Tallahassee, Florida, 32303-4149. At these deliberations, the Commission panel determined the action to be taken on the Petition for Relief."],
        "heading_2": "Finding of Fact and Conclusion of Law",
        "heading_2_text": ["The Administrative Law Judge found that seven positions were at issue for which Petitioner alleged that he had applied (positions 80655, 64251, 63640, 00159, 21778, 64274 and 80996), but for which Petitioner was not hired. Recommended Order, 5. In each instance, Petitioner alleged that his failure to be hired was on the basis of his race, sex and age. Recommended Order, 1. The Administrative Law Judge found that Petitioner had not filed an application for position 63640, and that, therefore, the allegations for that claim need not be adjudicated. Recommended Order, 25. While the Administrative Law Judge found that no prima facie case of discrimination had been established with regard to some of the alleged bases, the Administrative Law Judge did find, with regard to each of the six positions remaining in question, that a prima facie case of discrimination had been established at least as to one or more of the alleged bases. Recommended Order, 26. The Administrative Law Judge also found that Respondent rebutted the established prima facie cases of discrimination in that, in each instance, the most qualified person was hired for the position, someone other than Petitioner. Recommended Order, 21 and 27. The First District Court of Appeal has stated, '...with regard to employment discrimination cases such as this, the proper standard of review as to findings made by the administrative law judge is whether the findings are 'clearly erroneous.' In Department of Community Affairs v. Bryant, 586 So. 2d 1205, 1209 (Fla. 1st DCA 1991), an employment discrimination case, we said: The ultimate question of the existence of discrimination is a question of fact. Thus, an appellate court's power to alter the lower tribunal's finding in that regard is limited to those findings that are clearly erroneous.... Consequently, a hearing officer's finding of no discrimination should only be set aside if that finding is clearly erroneous, or is based on clearly erroneous findings of fact or a mistaken view of the law.' Department of Business and Professional Regulation v. Balaguer, 729 So. 2d 536 (Fla. 1st DCA 1999). In Balaguer, the court went on to conclude, 'Having carefully read the record, we can find no evidentiary support for the critical findings of fact set out above. As a result, we are constrained to conclude that they are clearly erroneous. Without the support of those findings, the ultimate finding of gender discrimination is, likewise, clearly erroneous, and cannot stand.' Id. In the instant case, we likewise (by a 2 to 1 vote, Commissioners Farrell and Paige in the majority, Commissioner Sosa in the minority) can find no evidentiary support for the critical finding that for each of the six positions remaining in question the most qualified individual was hired for the position. Since this finding is the rebuttal to the established prima facie cases of discrimination for each position, without the support of the finding, the ultimate finding that no discrimination occurred is, likewise, clearly erroneous, and cannot stand. In describing the burdens of proof in employment discrimination cases the United States Supreme Court has stated, 'First, the plaintiff has the burden of proving by a preponderance of the evidence a prima facie case of discrimination. Second, if the plaintiff succeeds in proving the prima facie case, the burden shifts to the defendant to articulate some legitimate, nondiscriminatory reason for the employee's rejection.... The defendant knows that its failure to introduce evidence of a nondiscriminatory reason will cause judgment to go against it unless the plaintiff's prima facie case is held to be inadequate at law or fails to convince the fact finder.' St. Mary's Honor Center v. Hicks, 113 S. Ct. 2742, at 2749 fn. 3 (1993). Based on the foregoing, we find that the establishment of prima facie cases of discrimination in the instant case, and the absence of supported findings of a legitimate, nondiscriminatory reason for Respondent's failure to hire Petitioner for the six positions in question, result in the necessary ultimate finding that Respondent's failure to hire Petitioner was in each instance unlawfully discriminatory, and we, consequently, reverse the findings of the Administrative Law Judge that no discrimination occurred in Respondent's failure to hire Petitioner for the six positions in question."],
        "heading_3": "Exceptions",
        "heading_3_text":["Petitioner filed 17 numbered exceptions to the Administrative Law Judge's Recommended Order, in a document entitled 'Petitioner's Exceptions to Proposed Recommended order in the case DOAH 99-4039; FCHR 98-0366, Issued 7th day of April, 2000.' Collectively these exceptions except to the Administrative Law Judge's finding that no unlawful employment practices occurred in this case. Given the Commission's findings, above, we find it unnecessary to consider the merits of the individual exceptions and, consequently, we reject Petitioner's exceptions, noting that our action on the exceptions has no impact on the outcome of the matter."],
        "heading_4": "Remand",
        "heading_4_text":["The Petition for Relief and Complaint of Discrimination are REMANDED to the Administrative Law Judge for determination of the appropriate remedy for the Respondent's unlawful failure to hire Petitioner for positions 80655, 64251, 00159, 21778, 64274, 80996."],
        "heading_5": "",
        "heading_5_text":[""],
        "heading_6": "",
        "heading_6_text":[""],
        "heading_7": "",
        "heading_7_text":[""],
        "heading_8": "",
        "heading_8_text":[""],
        "heading_9": "",
        "heading_9_text":[""],
        "heading_10": "",
        "heading_10_text":[""],
        "heading_11": "",
        "heading_11_text":[""],
        "heading_12": "",
        "heading_12_text":[""]
    }
}
