{

    "case_num": {
        "fchr": "Order No. 00-008",
        "doah": "Case No. 95-3061"
    },
    "judge": {
        "name":"Daniel Manry"
    },
    "casetype": {
        "type": "UNLAWFUL EMPLOYMENT PRACTICE"
    },

    "description": "Petitioner Brenda L. Oragui filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1995), alleging that Respondent Days Inn, committed an unlawful employment practice on the basis of Petitioner's age (50) when it terminated Petitioner from the position of executive housekeeper.",
    "name": {
        "petitioner": "Brenda L. Oragui",
        "respondent": "SUMA Enterprises, Inc. d/b/a Days Inn, a/k/a Howard Johnson Fairway, Inc."
      },
    "attorneys": {
        "atty_petitioner": "Ryan Allen, Esq.",
        "atty_respondent": "Pro Se"
      },

    "result": {
        "description": "Affirmative Relief Afforded"

    },
    "title": {
        "description": "FINAL ORDER AWARDING AFFIRMATIVE RELIEF FROM AN UNLAWFUL EMPLOYMENT PRACTICE"

    },
    "opinion": {
        "heading_1": "Preliminary Matters",
        "heading_1_text": ["Petitioner Brenda L. Oragui filed a complaint of ",
          "discrimination pursuant to the Florida Civil Rights Act of 1992, ",
          "Sections 760.01 - 760.11, Florida Statutes (1995), alleging that Respondent ",
          "Days Inn, committed an unlawful employment practice on the basis of ",
          "Petitioner's age (50) when it terminated Petitioner from the position ",
          "of executive housekeeper. Petitioner requested an administrative hearing, ",
          "and the case was transmitted to the Division of Administrative Hearings for ",
          "the conduct of a formal proceeding. An evidentiary hearing was held in Orlando, ",
          "Florida, on September 1, 1999, before Administrative Law Judge Daniel Manry, ",
          "who participated by video conference from Tallahassee, Florida. Judge Manry ",
          "issued a Recommended Order on November 2, 1999, recommending that the Commission ",
          "enter a final order finding that Respondent unlawfully discriminated against ",
          "Petitioner on the basis of her age. Pursuant to notice, public deliberations ",
          "were held on July 25, 2000, by means of Communications Media Technology ",
          "(namely, telephone) before this panel of Commissioners. The public access point ",
          "for these telephonic deliberations was the Office of the Florida Commission on ",
          "Human Relations, 325 John Knox Road, Building F, Suite 240, Tallahassee, Florida, ",
          "32303-4149. At these deliberations, the Commission panel determined the action to ",
          "be taken on the Recommended Order."],
        "heading_2": "Finding of Fact",
        "heading_2_text": ["A transcript of the proceeding before the Administrative ",
          "Law Judge was not filed with the Commission. We adopt the Administrative ",
          "Law Judge's findings of fact. "],
        "heading_3": "Conclusions of Law",
        "heading_3_text":["We find the Administrative Law Judge's application of ",
          "the law to the facts to result in a correct disposition of the matter. ",
          "We note that the Administrative Law Judge concluded that to establish a ",
          "prima facie case of age discrimination, 'Petitioner must show by a ",
          "preponderance of evidence that: she is a member of a protected class; ",
          "she suffered an adverse employment action; she received disparate treatment ",
          "from other similarly situated individuals in a non-protected class; and that ",
          "there is sufficient evidence of bias to infer a causal connection between her ",
          "age and the disparate treatment.' Recommended Order, 23. In a case involving ",
          "allegations of age discrimination, a Commission panel has indicated that, ",
          "'To establish a prima facie case of discrimination in situations where ",
          "individuals have lost their positions, it has been stated that a Petitioner ",
          "must show, '(1) that he belongs to a group protected by the statute; (2) that ",
          "he was qualified for the job; (3) that he was terminated; and (4) that after ",
          "his termination, the employer hired a person not in [P]etitioner's protected ",
          "class or retained those having comparable or lessor qualifications, not in the ",
          "protected class.' Arnold v. Department of Health and Rehabilitative Services, ",
          "16 F.A.L.R. 576, at 582 (FCHR 1993).' Green v. ATC/VANCOM Management, Inc., ",
          "20 F.A.L.R. 314, at 315 (FCHR 1997). With regard to the last element of the ",
          "above test cited by the Administrative Law Judge, the requirement that evidence ",
          "exist to infer a causal connection between the protected class and the disparate ",
          "treatment, the Commission has indicated that this element is actually what a ",
          "Petitioner is attempting to show by establishing a prima facie case of ",
          "discrimination, and that this element should not, itself, be an element of ",
          "the test for a prima facie case. See, Baxla v. Fleetwood Enterprises, Inc., ",
          "d/b/a Fleetwood Homes of Florida, Inc., 20 F.A.L.R. 2583, at 2585 (FCHR 1998), ",
          "citing Pugh v. Walt Disney World, 18 F.A.L.R. 1971, at 1972 (FCHR 1995), and ",
          "Martinez v. Orange County Fleet Manager, 21 F.A.L.R. 163, at 164 (FCHR 1997). ",
          "In accordance with these Commission decisions, we hereby modify the test set ",
          "out by the Administrative Law Judge for the establishment of a prima facie ",
          "case of age discrimination to reflect that set out in Green, supra. In so ",
          "doing, we find: (1) that the conclusion of law being modified is one over which ",
          "the Commission has substantive jurisdiction, namely a conclusion of law stating ",
          "what must be demonstrated to establish a prima facie case of unlawful ",
          "discrimination under the Florida Civil Rights Act of 1992; (2) that the reason ",
          "the modification is being made by the Commission is that the conclusion of law ",
          "as stated runs contrary to previous Commission decisions on the issue; and (3) ",
          "that in making this modification the conclusion of law we are substituting is as ",
          "or more reasonable than the conclusion of law which has been rejected. See, ",
          "Section 120.57(1)(l), Florida Statutes (1999). With the above-indicated modification, ",
          "we adopt the Administrative Law Judge's conclusions of law. "],
        "heading_4": "Exceptions",
        "heading_4_text":["Neither party filed exceptions to the Administrative Law Judge's Recommended Order."],
        "heading_5": "Affirmative Relief",
        "heading_5_text":["Through our adoption of the Administrative Law Judge's findings ",
          "of fact and conclusions of law, as set out above, we find that an unlawful ",
          "employment practice has occurred in this matter and have adopted the Administrative ",
          "Law Judge's recommendations for the remedy of that unlawful employment practice. Respondent ",
          "is hereby ORDERED: (1) to cease and desist from discriminating further in the ",
          "manner it has been found to have unlawfully discriminated against Petitioner; ",
          "(2) to reinstate Petitioner to the rate of compensation she was receiving at the ",
          "date of her discharge; (3) to remit back pay to Petitioner in the amount of ",
          "$22,041.81, plus the amount of back pay that has accrued from the date of the ",
          "administrative hearing until such time as all back pay is remitted; (4) to pay ",
          "Petitioner the statutorily established interest on the amounts awarded Petitioner ",
          "in (3), above; (5) to pay Petitioner attorney's fees that have been reasonably ",
          "incurred in this matter by Petitioner; and (6) to pay Petitioner the amount ",
          "of costs that have been reasonably incurred in this matter by Petitioner. The ",
          "Commission reserves jurisdiction over the determination of precise amounts of ",
          "back pay, interest, attorney's fees, and costs awarded Petitioner. The parties ",
          "have the right to seek judicial review of this Order. The Commission and the ",
          "appropriate District Court of Appeal must receive notice of appeal within 30 ",
          "days of the date this Order is filed with the Clerk of the Commission. Explanation ",
          "of the right of appeal is found in Section 120.68, Florida Statutes, and in the ",
          "Florida Rules of Appellate Procedure 9.110."]
    }
}
