{

    "case_num": {
        "fchr": "Order No. 00-006",
        "doah": "Case No. 98-1722"
    },
    "judge": {
        "name":"P. Michael Ruff"
    },
    "casetype": {
        "type": "UNLAWFUL EMPLOYMENT PRACTICE"
    },

    "description": "",
    "name": {
        "petitioner": "Ernest C. Curry",
        "respondent": "United Parcel Service of America"
      },
    "attorneys": {
        "atty_petitioner": "Burton E. Strubhar, Esq.",
        "atty_respondent": "Ronald H. Kent, Esq."
      },

    "result": {
        "description": "Dismissed with Prejudice"

    },
    "title": {
        "description": "FINAL ORDER DISMISSING REQUEST FOR RELIEF FROM AN UNLAWFUL EMPLOYMENT PRACTICE"

    },
    "opinion": {
        "heading_1": "Preliminary Matters",
        "heading_1_text": ["Petitioner Ernest C. Curry filed a complaint of ",
          "discrimination pursuant to the Florida Civil Rights Act of 1992, ",
          "Sections 760.01 - 760.11, Florida Statutes (1995), alleging that ",
          "Respondent United Parcel Service of America, committed an unlawful ",
          "employment practice on the basis of Petitioner's race (Black), color, ",
          "handicap and retaliation when it terminated Petitioner from his ",
          "position as a delivery driver. Petitioner requested an administrative ",
          "hearing, and the case was transmitted to the Division of Administrative ",
          "Hearings for the conduct of a formal proceeding. An evidentiary hearing ",
          "was held in Pensacola, Florida, on October 20 - 21, 1998, before ",
          "Administrative Law Judge P. Michael Ruff. Judge Ruff issued a ",
          "Recommended Order of dismissal on June 24, 1999. Pursuant to notice, ",
          "public deliberations were held on April 13, 2000, by means of ",
          "Communications Media Technology (namely, telephone) before this panel ",
          "of Commissioners. The public access point for these telephonic ",
          "deliberations was the Office of the Florida Commission on Human ",
          "Relations, 325 John Knox Road, Building F, Suite 240, Tallahassee, ",
          "Florida, 32303-4149. At these deliberations, the Commission panel ",
          "determined the action to be taken on the Recommended Order. "],
        "heading_2": "Finding of Fact",
        "heading_2_text": ["We find the Administrative Law Judge's findings of ",
          "fact to be supported by competent substantial evidence. We adopt the ",
          "Administrative Law Judge's findings of fact."],
        "heading_3": "Conclusions of Law",
        "heading_3_text":["We find the Administrative Law Judge's application ",
          "of the law to the facts to result in a correct disposition of the matter. ",
          "We note that the Administrative Law Judge concluded that to establish ",
          "a prima facie case of handicap/disability discrimination Petitioner must ",
          "prove (1) that he has a disability, (2) that he is a qualified individual, ",
          "and (3) that he was subjected to unlawful discrimination because of his ",
          "disability. Recommended Order, 57. A Commission panel has indicated, ",
          "'to establish a prima facie case of handicap discrimination the Petitioner ",
          "must show: (1) she is handicapped; (2) that she performed or is able to ",
          "perform her assigned duties satisfactorily; and (3) that despite her ",
          "satisfactory performance, she was terminated. Swenson-Davis v. Orlando ",
          "Partners, Inc., 16 F.A.L.R. 792, at 798 (FCHR 1993). If this burden is ",
          "sustained, the Respondent must articulate some legitimate nondiscriminatory ",
          "reason for its action. Hart v. Double Envelope Corporation, 15 F.A.L.R. ",
          "1664, at 1673 (FCHR 1992). Once this is articulated, the burden returns to ",
          "the Petitioner to demonstrate the Respondent intentionally discriminated ",
          "against the Petitioner. See St. Mary's Honor Center v. Hicks, 113 S. Ct. 2742 ",
          "(1993).' O'Neill v. Sarasota County School Board, 18 F.A.L.R. 1129, at 1130 ",
          "(FCHR 1994). With regard to the third element of the above test cited by ",
          "the Administrative Law Judge, the Commission has indicated that this ",
          "element is actually what a Petitioner is attempting to show by establishing ",
          "a prima facie case of discrimination, and that this element should not, ",
          "itself, be an element of the test for a prima facie case. See, Baxla v. ",
          "Fleetwood Enterprises, Inc., d/b/a Fleetwood Homes of Florida, Inc., 20 F.A.L.R. ",
          "2583, at 2585 (FCHR 1998), citing Pugh v. Walt Disney World, 18 F.A.L.R. 1971, ",
          "at 1972 (FCHR 1995), and Martinez v. Orange County Fleet Manager, 21 ",
          "F.A.L.R. 163, at 164 (FCHR 1997). In accordance with these Commission decisions, ",
          "we accordingly modify the test set out by the Administrative Law Judge for ",
          "the establishment of a prima facie case of handicap/disability discrimination ",
          "to reflect that set out in O'Neill, supra. In so doing, we find: (1) that the ",
          "conclusion of law being modified is one over which the Commission has substantive ",
          "jurisdiction, namely a conclusion of law stating what must be demonstrated to ",
          "establish a prima facie case of unlawful discrimination under the Florida Civil ",
          "Rights Act of 1992; (2) that the reason the modification is being made by the ",
          "Commission is that the conclusion of law as stated runs contrary to previous ",
          "Commission decisions on the issue; and (3) that in making this modification the ",
          "conclusion of law we are substituting is as or more reasonable than the conclusion ",
          "of law which has been rejected. See, Section 120.57(1)(l), Florida Statutes (1999). ",
          "With the above-indicated modification, we adopt the Administrative Law Judge's conclusions of law."],
        "heading_4": "Exceptions",
        "heading_4_text":["Petitioner filed fifteen numbered exceptions to the Recommended ",
          "Order in a document entitled, 'Exceptions to Proposed Recommended Order,' ",
          "dated October 11, 1999. All the exceptions contained therein take issue ",
          "with the Administrative Law Judge's findings from the evidence presented ",
          "and inferences drawn therefrom, as well as witness credibility determinations. ",
          "It is well settled that it is the Administrative Law Judge's function 'to ",
          "consider all of the evidence presented and reach ultimate conclusions of ",
          "fact based on competent substantial evidence by resolving conflicts, ",
          "judging the credibility of witnesses and drawing permissible inferences ",
          "therefrom. If the evidence presented supports two inconsistent findings, ",
          "it is the Administrative Law Judge's role to decide between them.' ",
          "Beckton v. Department of Children and Family Services, 21 F.A.L.R. 1735, ",
          "at 1736 (FCHR 1998), citing Maggio v. Martin Marietta Aerospace, ",
          "9 F.A.L.R. 2168, at 2171 (FCHR 1986). We deny Petitioner's exceptions. "],
        "heading_5": "Dismissal",
        "heading_5_text":["The Request for Admistrative Relief and Complaint of ",
          "Discrimination are DISMISSED with prejudice. The parties have the ",
          "right to seek judicial review of this Order. The Commission and the ",
          "appropriate District Court of Appeal must receive notice of appeal ",
          "within 30 days of the date this Order is filed with the Clerk of the ",
          "Commission. Explanation of the right to appeal is found in Section ",
          "120.68, Florida Statutes, and in the Florida Rules of Appellate Procedure 9.110."]
    }
}
