{

    "case_num": {
        "fchr": "Order No. 00-005",
        "doah": "Case No. 98-3082"
    },
    "judge": {
        "name":"P. Michael Ruff"
    },
    "casetype": {
        "type": "UNLAWFUL EMPLOYMENT PRACTICE"
    },

    "description": "Petitioner Roberta McCabe filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1995), alleging that Respondent Woodland Towers, committed an unlawful employment practice on the basis of Petitioner's age (61) when it terminated Petitioner from her position.",
    "name": {
        "petitioner": "Roberta McCabe",
        "respondent": "Woodland Towers"
      },
    "attorneys": {
        "atty_petitioner": "Roberta McCabe, Pro Se",
        "atty_respondent": "Tom Leek, Esq."
      },

    "result": {
        "description": "Remand to Administrative Law Judge"

    },
    "opinion": {
        "heading_1": "Preliminary Matters",
        "heading_1_text": ["Petitioner Roberta McCabe filed a complaint of ",
          "discrimination pursuant to the Florida Civil Rights Act of 1992, ",
          "Sections 760.01 - 760.11, Florida Statutes (1995), alleging that ",
          "Respondent Woodland Towers, committed an unlawful employment practice ",
          "on the basis of Petitioner's age (61) when it terminated Petitioner ",
          "from her position. Petitioner requested an administrative hearing ",
          "and the Commission transmitted the case to the Division of ",
          "Administrative Hearings for the conduct of a formal proceeding. An ",
          "evidentiary hearing was held in Deland, Florida, on December 9, 1998, ",
          "before Administrative Law Judge P. Michael Ruff. Judge Ruff issued ",
          "a Recommended Order of dismissal, dated April 5, 1999. Pursuant ",
          "to notice, public deliberations were held on January 27, 2000, ",
          "by means of Communications Media Technology (namely, telephone) ",
          "before this panel of Commissioners. The public access point for ",
          "these telephonic deliberations was the Office of the Florida ",
          "Commission on Human Relations, 325 John Knox Road, Building F, ",
          "Suite 240, Tallahassee, Florida, 32303-4149. At these deliberations, ",
          "the Commission panel determined the action to be taken on the Recommended Order."],
        "heading_2": "Conclusions of Law",
        "heading_2_text": ["We find it necessary to correct/modify the conclusions ",
          "of law set out by the Administrative Law Judge in the Recommended Order. ",
          "First, the Administrative Law Judge suggests that to establish a prima ",
          "facie case of discrimination in this matter the Petitioner must provide ",
          "either direct evidence of discriminatory intent or statistical evidence ",
          "that there is a pattern of discrimination in her employment situation. ",
          "See, Recommended Order, 16 and 17. We find this to be an error of law. ",
          "To establish a prima facie case of discrimination in a termination ",
          "case the Petitioner must demonstrate, '(1) that he belongs to a group ",
          "protected by the statute; (2) that he was qualified for the job; (3) ",
          "that he was terminated; and (4) that after his termination, the employer ",
          "hired a person not in [P]etitioner's protected class or retained those ",
          "having comparable or lessor qualifications, not in the protected class.'",
          " Arnold v. Department of Health and Rehabilitative Services, 16 F.A.L.R. ",
          "576, at 582 (FCHR 1993). Accordingly, we correct this conclusion of law ",
          "set out by the Administrative Law Judge. Second, we find the conclusion ",
          "of law set out in paragraph 18 of the Recommended Order to lack the ",
          "required preliminary analysis for the conclusion reached. The ",
          "Administrative Law Judge indicates in paragraph 18 of the Recommended ",
          "Order that Petitioner failed to establish that any Woodland Towers ",
          "employee had committed a similar infraction but was treated more ",
          "favorably than Petitioner, apparently recognizing as an issue in ",
          "the case the possibility of the unlawful discriminatory imposition ",
          "of discipline. It has been stated that, 'to establish a prima facie ",
          "case of discrimination in cases involving allegations of the ",
          "discriminatory imposition of discipline, Petitioner, 'in addition to ",
          "being a member of a protected class, must show either (a) that he did ",
          "not violate the work rule (in question), or (b) that he engaged in ",
          "misconduct similar to that of a person outside the protected class, ",
          "and that the disciplinary measures enforced against him were more ",
          "severe than those enforced against the other persons who engaged in ",
          "similar misconduct.' Lumpkin v. Occidental Chemical Company, 19 F.A.L.R. ",
          "1542, at 1547, 1548 (FCHR 1996).'' Baxla v. Fleetwood Enterprises, Inc., ",
          "d/b/a Fleetwood Homes of Florida, Inc., 20 F.A.L.R. 2583, at 2585 ",
          "(FCHR 1998). While the Administrative Law Judge suggested that the ",
          "rudeness and hostility to fellow employees by another employee did ",
          "not rise to the level of the infractions committed by Petitioner in ",
          "violation of Federal Wage and Hour laws and the Respondent's policies, ",
          "there is no analysis by the Administrative Law Judge regarding whether ",
          "the conduct of this individual violated Federal or state employment ",
          "discrimination laws by creating an unlawful hostile work environment ",
          "based on a protected class, and, if so, whether this violation amounted ",
          "to misconduct similar to that engaged in by Petitioner. Recommended ",
          "Order, 18. Consequently, we REMAND this matter to the Administrative ",
          "Law Judge to make all findings and conclusions necessary to determine ",
          "whether Petitioner's termination amounted to the unlawful discriminatory ",
          "imposition of discipline. Finally, we find: (1) that the Administrative ",
          "Law Judge's conclusions of law we are correcting and modifying are ",
          "within the substantive jurisdiction of the Florida Commission on Human ",
          "Relations, namely conclusions of law stating what must be demonstrated ",
          "to establish a prima facie case of unlawful discrimination; (2) the ",
          "reasons we are rejecting/modifying these conclusions are (a) the test ",
          "for establishing a prima facie case of discrimination was stated ",
          "incorrectly by the Administrative Law Judge, and (b) sufficient ",
          "findings were not made to apply the appropriate conclusions of ",
          "law relating to the establishment of a prima facie case of the ",
          "discriminatory imposition of discipline; and (3) that in making ",
          "these corrections/modifications the conclusions of law we are ",
          "substituting are as or more reasonable than those conclusions ",
          "which have been rejected and modified."],
        "heading_3": "Remand",
        "heading_3_text":["The Request for Administrative Hearing and ",
          "Complaint of Discrimination are hereby REMANDED to the ",
          "Administrative Law Judge for further proceedings consistent ",
          "with the Commission's instructions contained in this Order."],
        "heading_4": "",
        "heading_4_text":["(While Commissioner Clarethea Brooks voted to ",
          "adopt the Recommended Order of the Administrative Law Judge, ",
          "upon votes to not adopt the Recommended Order by Commissioners ",
          "Whitfield Jenkins and Aristides Sosa, Commissioner Brooks joined ",
          "Commissioners Jenkins and Sosa in voting to remand the matter to ",
          "the Administrative Law Judge.)"]
    }
}
