{

    "case_num": {
        "fchr": "Order No. 00-003",
        "doah": "Case No. 96-4160"
    },
    "judge": {
        "name":"Donald R. Alexander"
    },
    "casetype": {
        "type": "DISCRIMINATORY HOUSING PRACTICE"
    },

    "description": "Petitioner Melanie A. Hils filed a housing discrimination complaint pursuant to the Fair Housing Act, Sections 760.20 - 760.37, Florida Statutes (1995), alleging that Respondent Advantage Property Management, Inc., committed a discriminatory housing practice on the basis of Petitioner's sex (female) by sexually harassing Petitioner.",
    "name": {
        "petitioner": "Melanie A. Hils",
        "respondent": "Advantage Property Management, Inc."
      },
    "attorneys": {
        "atty_petitioner": "Migdalia Figueroa, Esq.",
        "atty_respondent": "Vernon L. Dean, Esq."
      },

    "result": {
        "description": "Dismissed with Prejudice"

    },
    "opinion": {
        "heading_1": "Preliminary Matters",
        "heading_1_text": ["Petitioner Melanie A. Hils filed a housing discrimination ",
          "complaint pursuant to the Fair Housing Act, Sections 760.20 - 760.37, ",
          "Florida Statutes (1995), alleging that Respondent Advantage Property ",
          "Management, Inc., committed a discriminatory housing practice on the ",
          "basis of Petitioner's sex (female) by sexually harassing Petitioner. ",
          "The allegations set forth in the complaint were investigated, and, ",
          "on July 16, 1996, the Commission issued its determination finding that ",
          "there was no reasonable cause to believe that a discriminatory housing ",
          "practice occurred.",
          "Petitioner filed a Petition for Relief from a Discriminatory Housing ",
          "Practice and the case was transmitted to the Division of Administrative ",
          "Hearings for the conduct of a formal proceeding. ",
          "An evidentiary hearing was held in Jacksonville, Florida, on March 14, ",
          "1997, before Administrative Law Judge Donald R. Alexander. Judge ",
          "Alexander issued a Recommended Order of dismissal, dated May 6, 1997.",
          "Pursuant to notice, public deliberations were held on January 27, 2000, ",
          "by means of Communications Media Technology (namely, telephone) before ",
          "this panel of Commissioners. The public access point for these telephonic ",
          "deliberations was the Office of the Florida Commission on Human Relations, ",
          "325 John Knox Road, Building F, Suite 240, Tallahassee, Florida, 32303-4149. ",
          "At these deliberations, the Commission panel determined the action to be ",
          "taken on the Petition for Relief."],
        "heading_2": "Finding of Fact",
        "heading_2_text": ["We find the Administrative Law Judge's application ",
          "of the law to the facts to result in a correct disposition of the matter. ",
          "We adopt the Administrative Law Judge's conclusions of law."],
        "heading_3": "Conclusions of Law",
        "heading_3_text":["We find the Administrative Law Judge's application of ",
          "the law to the facts to result in a correct disposition of the matter. ",
          "We adopt the Administrative Law Judge's conclusions of law."],
        "heading_4": "Exceptions",
        "heading_4_text":["Petitioner filed four numbered exceptions to the ",
          "Administrative Law Judge's Recommended Order, in a document entitled, ",
          "'Claimant's Exceptions to Recommended Order.' These exceptions take ",
          "issue with the Administrative Law Judge's findings from the evidence ",
          "presented and inferences drawn therefrom (including the ultimate ",
          "finding that no discriminatory housing practice occurred in this matter). ",
          "It is well settled that it is the Administrative Law Judge's function ",
          "'to consider all of the evidence presented and reach ultimate conclusions ",
          "of fact based on competent substantial evidence by resolving conflicts, ",
          "judging the credibility of witnesses and drawing permissible inferences ",
          "therefrom. If the evidence presented supports two inconsistent findings, ",
          "it is the Administrative Law Judge's role to decide between them.'",
          " Beckton v. Department of Children and Family Services, 21 F.A.L.R. ",
          "1735, at 1736 (FCHR 1998), citing Maggio v. Martin Marietta Aerospace, ",
          "9 F.A.L.R. 2168, at 2171 (FCHR 1986). We reject Petitioner's exceptions."],
        "heading_5": "Dismissal",
        "heading_5_text":["The Petition for Relief and Complaint of Discrimination ",
          "are DISMISSED with prejudice. The parties have the right to seek ",
          "judicial review of this Order. The Commission and the appropriate District ",
          "Court of Appeal must receive notice of appeal within 30 days of the date ",
          "this Order is filed with the Clerk of the Commission. Explanation of ",
          "the right to appeal is found in Section 120.68, Florida Statutes, and ",
          "in the Florida Rules of Appellate Procedure 9.110. Done and Ordered ",
          "this 11th day of February, 2000. For The Florida Commission on Human Relations."],
        "heading_6": "Dissent",
        "heading_6_text":["Commissioner Clarethea Brooks, dissenting: I find the ",
          "arguments set out by Petitioner in the filing entitled, 'Claimant's ",
          "Exceptions to Recommended Order,' to be persuasive, and, consequently, ",
          "I would accept Petitioner's exceptions to the Recommended Order and ",
          "find that a discriminatory housing practice occurred in this matter."]
    }
}
