{"attorneys": {"atty_petitioner": "Jerrylene Barr, Pro Se", "atty_respondent": "Kip P. Roth, Esq."}, "case_num": {"doah": "00-2658", "fchr": "01-012"}, "casetype": {"type": "Unlawful Employment Practice"}, "description": "Petitioner Anthony Akins filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1995), alleging that Respondent Department of Law Enforcement committed unlawful employment practices on the basis of Petitioner's race and on the basis of retaliation.The allegations set forth in the complaint were investigated, and, on May 16, 2000, the Executive Director issued his determination finding that there was no reasonable cause to believe that an unlawful employment practice had occurred.Petitioner filed a Petition for Relief from an Unlawful Employment Practice and the case was transmitted to the Division of Administrative Hearings for the conduct of a formal proceeding.In considering Respondent's Motion for Summary Final Order, Administrative Law Judge Suzanne F. Hood issued a Recommended Order of Dismissal, dated October 12, 2000.The Commission panel designated below considered the record of this matter and determined the action to be taken on the Recommended Order of Dismissal.Finding of FactWe find the Administrative Law Judge's findings of fact to be supported by competent substantial evidence.We adopt the Administrative Law Judge's findings of fact.Conclusions of LawWe find the Administrative Law Judge's application of the law to the facts to result in a correct disposition of the matter.We note a statement of the Administrative Law Judge that we believe requires correction/clarification.", "judge": {"name": "Suzanne F. Hood"}, "name": {"petitioner": "Anthony Akins", "respondent": "Department Of Law Enforcement"}, "opinion": {"heading_1": "Preliminary Matters", "heading_1_text": ["Petitioner Anthony Akins filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1995), alleging that Respondent Department of Law Enforcement committed unlawful employment practices on the basis of Petitioner's race and on the basis of retaliation.The allegations set forth in the complaint were investigated, and, on May 16, 2000, the Executive Director issued his determination finding that there was no reasonable cause to believe that an unlawful employment practice had occurred.Petitioner filed a Petition for Relief from an Unlawful Employment Practice and the case was transmitted to the Division of Administrative Hearings for the conduct of a formal proceeding.In considering Respondent's Motion for Summary Final Order, Administrative Law Judge Suzanne F. Hood issued a Recommended Order of Dismissal, dated October 12, 2000.The Commission panel designated below considered the record of this matter and determined the action to be taken on the Recommended Order of Dismissal."], "heading_2": "Finding of Fact", "heading_2_text": "hellp", "heading_3": "Conclusions of Law", "heading_3_text": ["We find the Administrative Law Judge's application of the law to the facts to result in a correct disposition of the matter.We note a statement of the Administrative Law Judge that we believe requires correction/clarification. Specifically, the Administrative Law Judge stated, 'The Division of Administrative Hearings has no jurisdiction to hear allegations of discriminatory conduct which FCHR has not investigated or made a determination as to reasonable cause.'  Recommended Order of Dismissal,¶ 19.The Florida Civil Rights Act of 1992 does allow Petitioners to file a request for administrative hearing in situations where 180 days have passed since the filing of the complaint and the Commission has not yet reached a determination as to reasonable cause, and, therefore, in those instances, the Division of Administrative Hearings would have jurisdiction to hear allegations of discriminatory conduct 'which FCHR has not investigated or made a determination as to reasonable cause.' See, Sections 760.11(8) and 760.11(4), Florida Statutes (1999).We, therefore, correct/clarify this conclusion of law.In so doing we find: (1) that the Administrative Law Judge's conclusion of law we are correcting is within the substantive jurisdiction of the Florida Commission on Human Relations, namely the interpretation of in what instances a Petitioner is entitled to an administrative hearing under the Florida Civil Rights Act of 1992; (2) the reason the correction is being made is that the conclusion of law as stated by the Administrative Law Judge is not supported in law; and (3) that in making this correction the rejection of the conclusion of law in question is as or more reasonable than allowing the incorrect conclusion of law to remain.  See, Section 120.57(1)(l), Florida Statutes (1999).With the above-stated correction/clarification, we adopt the Administrative Law Judge's conclusions of law."], "heading_4": "Exceptions", "heading_4_text": ["Neither party filed exceptions to the Administrative Law Judge's recommended order."], "heading_5": "Dismissal", "heading_5_text": "Hm"}, "result": {"description": "Dismissed with Prejudice"}, "title": {"description": "FINAL ORDER DISMISSING PETITION FOR\n                   RELIEF FROM AN UNLAWFUL EMPLOYMENT PRACTICE"}}
