[

    {
        "year": 1999,
        "id": "99-036",
        "judge": {
            "name":"Daniel Manry"
        },
        "name": "Lydia Cortes, Petitioner v. Concord Management, Ravens Crossing Apartments, Respondent",
        "snippet": "Petitioner Lydia Cortes filed a housing discrimination complaint pursuant to the Fair Housing Act, Sections 760.20 - 760.37, Florida Statutes (1995), alleging that Respondent Concord Management, Ravens Crossing Apartments, committed discriminatory housing practices."
    },
    {
        "year": 1999,
        "id": "99-037",
        "judge": {
            "name":"Donald R. Alexander"
        },
        "name": "Jeffrey S. Wytrwal, Petitioner, v. Waste Management of Putnam, Respondent",
        "snippet": "Jeffrey S. Wytrwal filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1997), alleging that Respondent Waste Management of Putnam County committed an unlawful employment practice on the basis of Petitioner's alleged disability (knee problems)."
    },
    {
        "year": 1999,
        "id": "99-038",
        "judge": {
            "name":"Donald R. Alexander"
        },
        "name": "Jerrylene Barr, Petitioner, v. Columbia Ocala Regional Medical Center, Respondent",
        "snippet": "Petitioner Jerrylene Barr filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1993), alleging that Respondent Columbia Ocala Regional Medical Center committed an unlawful employment practice on the basis of Petitioner's race (Black) when it terminated her from her position."
    },
    {
        "year": 2000,
        "id": "00-001",
        "judge": {
            "name":"P. Michael Ruff"
        },
        "name": "James O. Johnson, III, Petitioner, v. Pensacola Civic Center, Respondent",
        "snippet": "Petitioner James O. Johnson, III, filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1993), alleging that Respondent Pensacola Civic Center, committed an unlawful employment practice on the basis of Petitioner's race (Black) by terminating Petitioner from his position."
    },
    {
        "year": 2000,
        "id": "00-002",
        "judge": {
            "name":"P. Michael Ruff"
        },
        "name": "Earline Macy, Petitioner, v. Caribe Club Co-Operative Apartments, Inc., and The Board of Directors, Respondent",
        "snippet": "Petitioner Melanie A. Hils filed a housing discrimination complaint pursuant to the Fair Housing Act, Sections 760.20 - 760.37, Florida Statutes (1995), alleging that Respondent Advantage Property Management, Inc., committed a discriminatory housing practice on the basis of Petitioner's sex (female) by sexually harassing Petitioner."
    },
    {
        "year": 2000,
        "id": "00-003",
        "judge": {
            "name":"Donald R. Alexander"
        },
        "name": "Melanie A. Hils, Petitioner, v. Advantage Property Management, Inc., Respondent",
        "snippet": "Petitioner filed a housing discrimination complaint pursuant to the Fair Housing Act, Sections 760.20 - 760.37, Florida Statutes (1995), alleging that Respondents committed a discriminatory housing practice by rejecting Petitioner's attempts to purchase a housing unit."
    },
    {
        "year": 2000,
        "id": "00-004",
        "judge": {
            "name":"J. Lawrence Johnston"
        },
        "name": "Abad A. Perez and Luz E. Colon, Petitioners, v. Sunset Homes of Pasco, Inc and Mr. John Frank, President, Respondent",
        "snippet": "Abad A. Perez and Luz E. Colon filed a housing discrimination complaint pursuant to the Fair Housing Act alleging that Respondents committed a discriminatory housing practice on the basis of Petitioners' race (Black) and national origin (Hispanic) by failing to build Petitioners' home to agreed-upon specifications."
    },
    {
        "year": 2000,
        "id": "00-005",
        "judge": {
            "name":"P. Michael Ruff"
        },
        "name": "Roberta McCabe, Petitioner, v.Woodland Towers, Respondent",
        "snippet": "Petitioner Roberta McCabe filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1995), alleging that Respondent Woodland Towers, committed an unlawful employment practice on the basis of Petitioner's age (61) when it terminated Petitioner from her position."
    },
    {
        "year": 2000,
        "id": "00-006",
        "judge": {
            "name":"P. Michael Ruff"
        },
        "name": "Ernest C. Curry, Petitioner, v. United Parcel Service of America, Respondent",
        "snippet": "Petitioner filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1995), alleging that Respondent committed an unlawful employment practice on the basis of Petitioner's race (Black), color, handicap and retaliation when it terminated Petitioner from his position as a delivery driver."
    },
    {
        "year": 2000,
        "id": "00-008",
        "judge": {
            "name":"Daniel Manry"
        },
        "name": "Brenda L. Oragui, Petitioner, v. Days Inn, Respondent",
        "snippet": "Petitioner Brenda L. Oragui filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1995), alleging that Respondent Days Inn, committed an unlawful employment practice on the basis of Petitioner's age (50) when it terminated Petitioner from the position of executive housekeeper."
    },
    {
        "year": 2000,
        "id": "00-012",
        "judge": {
            "name":"Daniel Manry"
        },
        "name": "John P. Finn, Petitioner, v. City of Holly Hill, Respondent",
        "snippet": "Petitioner John P. Finn filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1997), alleging that Respondent City of Holly Hill, committed an unlawful employment practice on the basis of Petitioner's age (57) and retaliation in matters surrounding Petitioner's separation from employment with Respondent."
    },
    {
        "year": 2000,
        "id": "00-011",
        "judge": {
            "name":"Donald R. Alexander"
        },
        "name": "Victor L. Major, Petitioner, v. Branch Properties, Inc., Respondent",
        "snippet": "Petitioner Victor L. Major filed a complaint of discrimination pursuant to the Florida Civil Rights Act of 1992, Sections 760.01 - 760.11, Florida Statutes (1997), alleging that Respondent Branch Properties, Inc., committed an unlawful employment practice on the basis of Petitioner's race (Black) when it terminated Petitioner from his position."
    }

]
